# import os
# from google import genai
# from dotenv import load_dotenv

# load_dotenv()

# API_KEY=os.getenv("API_KEY_GEMINI")

# client = genai.Client(api_key=API_KEY)

# msg="""
# Закупівля:
# Горох 🫘
# Нішеві зернові 🌿
# Кукурудза 🌽
# Соняшник 🌻
# Ріпак 🌱
# Соя 🍃
# Пшениця 🌾
# Жито ☘
# Шрот та макуха, олія 🥃
# Умови постачання: FCA, DAP, CPT.
# Олійні та зернові, продукти переробки, тверде паливо, добрива, логістика, хімічна галузь, фрукти й овочі, морожені та сушені снеки.
# Прості умови сплати, за контрактами.
# Об'єми:
# 500-1000тн.
# Від брокера. 
# Повні данні, база: оновлення.
# 2025рік Експорт+Імпорт 1, 2, 3й міс.
# 2024рік Імпорт з 1го по 12й міс.
# 2024рік Експорт оновлення з 1 по 5 та з 8го по 9й міс. Ви знаходите для розвитку бізнесу: актуальні контакти отримувачів в ЄС, та по всьому світу. Пошук та виявлення внутрішніх покупок - продажів, по конкуренту ПК-ПЗ вхід, вихід.
# Тел.: +380500781928
# """

# promt_text="""You are a moderator in the telegram chat.
# Your task it to determine wether the message is an advertisment. 
# Your response must be 1 if this is an advertisment or 0 if not. Message: """

# promt=promt_text+msg

# response = client.models.generate_content(
#     model='gemini-2.0-flash-lite', contents=promt
# )

# print(response)


async def is_advertisment(text):
    if (
        "ПРОДАМ" in text
        or "грн." in text
        or "тел." in text
        or "наш сайт" in text
    ):
        return True
    return False